In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
ser = pd.Series(np.arange(3.))

In [11]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [12]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [13]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [16]:
ser2.loc['c']
ser2.iloc[2]

2.0

In [19]:
ser2[:2]
ser2.iloc[:2]
ser2[:]

a    0.0
b    1.0
c    2.0
dtype: float64

In [20]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [22]:
data
# one열에 모두 1을 저장하시오.
data['one'] = 1
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [25]:
data.loc[ : , 'one']=2
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        2    9     10    11
New York    2   13     14    15

In [27]:
data.iloc[2] = 5

In [28]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [31]:
# four 열의 값이 5보다 큰 데이터를 추출하시오.
data[data['four'] >5]
data.loc[data['four'] >5]

          one  two  three  four
Colorado    2    5      6     7
New York    2   13     14    15

In [35]:
# three 열 값이 5인 자료를 추출하시오.
data.loc[data['three']==5]

      one  two  three  four
Utah    5    5      5     5

In [42]:
# three 열 값이 5인 자료의 two열 값을 추출하시오.
data[data['three']==5]['two'] # series
data[data['three'] == 5][['two']] # datafram

      two
Utah    5

In [44]:
data.loc[data['three']==5,'two'] = 10

In [45]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5   10      5     5
New York    2   13     14    15

In [46]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [47]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [48]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [49]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [50]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [66]:
list("bcd")

['b', 'c', 'd']

In [69]:
# df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns = ['b','c','d'])
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns = list("bcd"), 
                   index=["Ohio", "Texas", "Colorado"])

In [70]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [71]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

In [72]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [73]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [74]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [75]:
df1

   A
0  1
1  2

In [76]:
df2

   B
0  3
1  4

In [77]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [78]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [79]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [80]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [81]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [89]:
np.nan # 결축 값

nan

In [88]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [87]:
# df의 b2 추출
df2['b'][1]
df2.b[1]
df2.loc[1, 'b']
df2['b'][1]
df2.loc[1,"b"]

6.0

In [93]:
#df2['b'][1]=2
df2.loc[1, 'b']=np.nan

In [94]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [98]:
# df1+ df2
# 결과 값
# 	a	b	c	d	e
# 0	0.0	2.0	4.0	6.0	NaN
# 1	9.0	NaN	13.0	15.0	NaN
# 2	18.0	20.0	22.0	24.0	NaN
# 3	NaN	NaN	NaN	NaN	NaN


df1.add(df2, fill_value=0) # fill_value=0 : NaN을 0으로 채워라
# 결과 값
#     a	b	c	d	e
# 0	0.0	2.0	4.0	6.0	4.0
# 1	9.0	5.0	13.0	15.0	9.0
# 2	18.0	20.0	22.0	24.0	14.0
# 3	15.0	16.0	17.0	18.0	19.0

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [100]:
1/df1
# inf : 무한대 숫자

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [105]:
df1.div(2) # df1/2
df1.rdiv(2) # 2/df1
df1.rdiv(1) # 1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [106]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [107]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [109]:
df1.index
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [110]:
df2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [112]:
# 특정 프레임의 컬럼을 추가하고자 할때
df1.reindex(columns=df2.columns)

# NaN을 0으로 채우고자 할때
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [113]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [114]:
arr[0]

array([0., 1., 2., 3.])

In [117]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [118]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [119]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [124]:
ser = frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [125]:
frame - ser

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [126]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int64

In [127]:
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [131]:
frame.sub(series2)

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [132]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.299750 -1.516567 -0.570897
Ohio   -0.554861  0.402893  0.548316
Texas  -1.001127  0.644281  0.809223
Oregon  0.943434 -1.162359 -1.359909

In [133]:
# abs는 절대값 구하기
np.abs(frame)

               b         d         e
Utah    1.299750  1.516567  0.570897
Ohio    0.554861  0.402893  0.548316
Texas   1.001127  0.644281  0.809223
Oregon  0.943434  1.162359  1.359909

In [134]:
frame

               b         d         e
Utah   -1.299750 -1.516567 -0.570897
Ohio   -0.554861  0.402893  0.548316
Texas  -1.001127  0.644281  0.809223
Oregon  0.943434 -1.162359 -1.359909

In [138]:
# 열단위로 최대값 / 최소값 구해서 차를 출력
# max, min 함수 사용
frame['b'].max()
frame['b'].min()

frame['b'].max()-frame['b'].min()

2.2431835241614864

In [146]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    print(x)
    print(x.max())
    print(x.min())
    print((x.max())-(x.min()))
    print("="*50)
    
frame.apply(f1) # frame에 열 단위로 만든 f1함수를 적용해라

Utah     -1.299750
Ohio     -0.554861
Texas    -1.001127
Oregon    0.943434
Name: b, dtype: float64
0.9434337157814774
-1.299749808380009
2.2431835241614864
==================================================
Utah     -1.516567
Ohio      0.402893
Texas     0.644281
Oregon   -1.162359
Name: d, dtype: float64
0.6442808116938205
-1.5165668729759543
2.1608476846697746
==================================================
Utah     -0.570897
Ohio      0.548316
Texas     0.809223
Oregon   -1.359909
Name: e, dtype: float64
0.8092227599726507
-1.3599085037916392
2.1691312637642897
==================================================

b    None
d    None
e    None
dtype: object

In [147]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1) # frame에 열 단위로 만든 f1함수를 적용해라

b    2.243184
d    2.160848
e    2.169131
dtype: float64

In [148]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1,axis='columns') # frame에 열 단위로 만든 f1함수를 적용해라

Utah      0.945670
Ohio      1.103177
Texas     1.810350
Oregon    2.303342
dtype: float64

In [149]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1,axis=1) # frame에 열 단위로 만든 f1함수를 적용해라

Utah      0.945670
Ohio      1.103177
Texas     1.810350
Oregon    2.303342
dtype: float64

In [150]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1,axis=0) # frame에 열 단위로 만든 f1함수를 적용해라 / axis=0 =>default

b    2.243184
d    2.160848
e    2.169131
dtype: float64

In [151]:
def f2(x): #f2함수에 각각의 열들이 하나씩 전달
    return x.max(),x.min()

frame.apply(f2,axis=0) # frame에 열 단위로 만든 f2함수를 적용해라

          b         d         e
0  0.943434  0.644281  0.809223
1 -1.299750 -1.516567 -1.359909

In [153]:
def f2(x): #f2함수에 각각의 열들이 하나씩 전달
    return pd.Series([x.max(), x.min()]) # Series로 변환

frame.apply(f2,axis=0) # frame에 열 단위로 만든 f2함수를 적용해라

          b         d         e
0  0.943434  0.644281  0.809223
1 -1.299750 -1.516567 -1.359909

In [154]:
def f2(x): #f2함수에 각각의 열들이 하나씩 전달
    return pd.Series([x.max(), x.min()], index=['max', 'min']) # Series로 변환 / 최대값,최소값

frame.apply(f2,axis=0) # frame에 열 단위로 만든 f2함수를 적용해라

            b         d         e
max  0.943434  0.644281  0.809223
min -1.299750 -1.516567 -1.359909

In [155]:
frame

               b         d         e
Utah   -1.299750 -1.516567 -0.570897
Ohio   -0.554861  0.402893  0.548316
Texas  -1.001127  0.644281  0.809223
Oregon  0.943434 -1.162359 -1.359909

In [158]:
x = -1.299750
print(f"{x:.2f}")

-1.30

In [163]:
def my_format(x):
    return print(f"{x:.2f}")

frame.applymap(my_format)

-1.30
-0.55
-1.00
0.94
-1.52
0.40
0.64
-1.16
-0.57
0.55
0.81
-1.36

/var/folders/bs/rn4q13z924s9_wzlq41h6grc0000gn/T/ipykernel_1033/1191869841.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

           b     d     e
Utah    None  None  None
Ohio    None  None  None
Texas   None  None  None
Oregon  None  None  None

In [3]:
def my_format(x):
    return print(f"{x:.2f}")

frame['b'].applymap(my_format) # 시리즈에서는 appiymap을 사용할 수 없다 / map을 사용하기

NameError: name 'frame' is not defined

In [165]:
def my_format(x):
    return print(f"{x:.2f}")

frame['b'].map(my_format)

-1.30
-0.55
-1.00
0.94

Utah      None
Ohio      None
Texas     None
Oregon    None
Name: b, dtype: object

In [179]:
import seaborn as sns

In [4]:
tips=sns.load_dataset("tips")
tips

NameError: name 'sns' is not defined

In [181]:
# 1
def max_min(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(max_min)

# 2
def s1(s): 
    return s.max(), s.min()
pd.DataFrame(tips['tip']).apply(s1)

# 3
def minmax_tip(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(min_tip)

# 4
def f2(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(f2)

# 5
def minmax_tip(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(minmax_tip)

# 6
def max_min(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(max_min)

NameError: name 'tips' is not defined

In [185]:
tips['tip'].max()

NameError: name 'tips' is not defined

In [186]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [187]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [190]:
frame.sort_index(axis="columns") # 오름차순
frame.sort_index(axis="columns", ascending=False) # 내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [192]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [194]:
obj.sort_values() # 오름차순
obj.sort_values(ascending=False) # 내림차순

1    7
0    4
3    2
2   -3
dtype: int64

In [195]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [199]:
obj.sort_values()
obj.sort_values(ascending=False)
obj.sort_values(na_position='first') # na_position='first'있으면 NaN먼저 없으면 나중에 출력

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [200]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [203]:
frame.sort_values('a')
frame.sort_values('b')
frame.sort_values(['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [204]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [205]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [206]:
obj.rank(method='first') # 먼저 온 숫자가 등수가 높다

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [207]:
obj.rank(ascending=False) # 등수가 역순

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [208]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [212]:
frame.rank()
frame.rank(axis=0)
frame.rank(axis=1)
frame.rank(axis=1,ascending=False)
# axis=0 == index, axis=1 == columns

     b    a    c
0  1.0  2.0  3.0
1  1.0  3.0  2.0
2  3.0  2.0  1.0
3  1.0  2.0  3.0

In [215]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [216]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [217]:
obj.index.is_unique

False

In [218]:
obj['a']

a    0
a    1
dtype: int64

In [219]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  0.964664  2.659161 -0.265519
a  0.463132 -1.463848 -1.321361
b -1.072237 -0.559647 -0.789320
b  1.004619  1.055986  1.984071
c -0.805241  0.705115 -0.750402

In [220]:
df.loc["b"]

          0         1         2
b -1.072237 -0.559647 -0.789320
b  1.004619  1.055986  1.984071

In [221]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [222]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [223]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [224]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [226]:
df.sum(axis='index')

one    9.25
two   -5.80
dtype: float64

In [227]:
df.sum(axis='index',skipna=False)

one   NaN
two   NaN
dtype: float64

In [229]:
df
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [231]:
df.idxmax()

one    b
two    d
dtype: object

In [232]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [234]:
df.describe() # 기술통계
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 268.0+ bytes

In [5]:
df=pd.read_csv("pew.csv")
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
count,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000
mean,107.222222,154.500000,186.500000,183.444444,171.388889,288.055556,221.666667,177.611111,144.888889,340.055556
std,168.931784,255.172433,309.891869,291.470354,271.144446,458.442436,345.078849,275.679724,205.224952,530.523878
min,1.000000,2.000000,3.000000,4.000000,2.000000,7.000000,3.000000,4.000000,4.000000,8.000000
25%,12.250000,14.750000,17.000000,15.750000,15.000000,34.250000,25.250000,22.500000,23.750000,41.250000
50%,20.000000,27.000000,33.500000,40.000000,34.000000,66.500000,65.500000,48.500000,53.500000,74.500000
75%,170.000000,193.000000,192.000000,198.750000,166.750000,201.500000,128.750000,103.500000,134.250000,294.750000
max,575.000000,869.000000,1064.000000,982.000000,881.000000,1486.000000,949.000000,792.000000,634.000000,1529.000000

In [6]:
df=pd.read_csv("tesla_stock_quandl.csv")
df

,Date,Open,High,Low,Close,Volume,ExDividend,SplitRatio,AdjOpen,AdjHigh,AdjLow,AdjClose,AdjVolume
0,2018-03-27,304.00,304.2700,277.18,279.18,13696168.0,0.0,1.0,304.00,304.2700,277.18,279.18,13696168.0
1,2018-03-26,307.34,307.5900,291.36,304.18,8324639.0,0.0,1.0,307.34,307.5900,291.36,304.18,8324639.0
2,2018-03-23,311.25,311.6100,300.45,301.54,6600538.0,0.0,1.0,311.25,311.6100,300.45,301.54,6600538.0
3,2018-03-22,313.89,318.8200,308.18,309.10,4914307.0,0.0,1.0,313.89,318.8200,308.18,309.10,4914307.0
4,2018-03-21,310.25,322.4400,310.19,316.53,5927881.0,0.0,1.0,310.25,322.4400,310.19,316.53,5927881.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1944,2010-07-06,20.00,20.0000,15.83,16.11,6866900.0,0.0,1.0,20.00,20.0000,15.83,16.11,6866900.0
1945,2010-07-02,23.00,23.1000,18.71,19.20,5139800.0,0.0,1.0,23.00,23.1000,18.71,19.20,5139800.0
1946,2010-07-01,25.00,25.9200,20.27,21.96,8218800.0,0.0,1.0,25.00,25.9200,20.27,21.96,8218800.0
1947,2010-06-30,25.79,30.4192,23.30,23.83,17187100.0,0.0,1.0,25.79,30.4192,23.30,23.83,17187100.0
1948,2010-06-29,19.00,25.0000,17.54,23.89,18766300.0,0.0,1.0,19.00,25.0000,17.54,23.89,18766300.0

In [78]:
df=pd.read_csv("gapminder.tsv",sep="\t")

In [8]:
df.head()
df.tail()
df.info()
df.columns
df.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [9]:
# Zimbabwe 데이터만 추출하시오.
# 1
df[df.country == 'Zimbabwe']

# 2
df[df['country']=="Zimbabwe"]

       country continent  year  lifeExp       pop   gdpPercap
1692  Zimbabwe    Africa  1952   48.451   3080907  406.884115
1693  Zimbabwe    Africa  1957   50.469   3646340  518.764268
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [10]:
#df[df['country']=='Zimbabwe'].info()
df[df['continent']=='Africa'].shape[0]/12

52.0

In [80]:
df[df['continent']=='Africa']

       country continent  year  lifeExp       pop    gdpPercap
24     Algeria    Africa  1952   43.077   9279525  2449.008185
25     Algeria    Africa  1957   45.685  10270856  3013.976023
26     Algeria    Africa  1962   48.303  11000948  2550.816880
27     Algeria    Africa  1967   51.407  12760499  3246.991771
28     Algeria    Africa  1972   54.518  14760787  4182.663766
...        ...       ...   ...      ...       ...          ...
1699  Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143   469.709298

[624 rows x 6 columns]

In [84]:
# 1. 기대수명 데이터셋으로 아래의 작업을 수행하시오.
import pandas as pd
import numpy as np
# 1) iloc 속성으로 행 데이터 추출하기
df.iloc[[3]]

# 2) loc 속성으로 행 단위 데이터 추출하기
df.loc[[1]]

# 3) 열 단위로 데이터 추출하기
df['country']

# 4) 'year', 'pop' 데이터 추출하기
df[['year', 'pop']]

# 5) country continent  year 데이터 추출하기
df[['country', 'continent', 'year']]

# 6) country  year       pop 데이터 추출하기
df[['country', 'year', 'pop']]

# 7) loc, iloc 속성 자유자재로 사용하기
# 7-1 첫 번째 행과 특정 열 추출 : loc 사용
df.loc[0, ['country', 'year', 'lifeExp']]

# 7-2 첫 번째 행과 특정 열 추출 : iloc 사용
df.iloc[0, [0, 2, 3]]

# 7-3 여러 행과 특정 열 추출 : loc 사용
df.loc[[0, 1, 2], ['country', 'year', 'lifeExp']]

# 7-4 여러 행과 특정 열 추출 : iloc 사용
df.iloc[[0,1,2],[0,2,3]]

# 7-5 행과 열 슬라이싱 : loc 사용
df.loc[0:2, 'country':'lifeExp']

# 7-6 행과 열 슬라이싱 : iloc 사용
df.iloc[0:3, 0:4]

       country continent  year  lifeExp
0  Afghanistan      Asia  1952   28.801
1  Afghanistan      Asia  1957   30.332
2  Afghanistan      Asia  1962   31.997

In [15]:
# 2. 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
# - 10가지 이상의 방법으로 특정한 행과 열을 선택한다.
import pandas as pd
import numpy as np
data = np.random.randint(1,100, size=(6,6))
df = pd.DataFrame(data,index=['A','B','C','D','E','F'],columns = ['U','V','W','X','Y','Z'])
df

    U   V   W   X   Y   Z
A  57  26  97  35  90  67
B  29  58  43  79  13  19
C  53  44  56  32   4  83
D  76  85  91  88  28  10
E  86  88  71  80  23  66
F  70   9  77  33  88  94

In [30]:
# 2-1 단일행 선택 : loc
df.loc[['A']]

# 2-2 단일행 선택 : iloc
df.iloc[[4]]

# 2-3 단일열 선택 : loc
df.loc[:,'X']

# 2-4 단일열 선택 : iloc
df.iloc[:,2]

A    97
B    43
C    56
D    91
E    71
F    77
Name: W, dtype: int64

In [35]:
# 2-5 다중행 선택 : loc
df.loc[['A','C','D']]

# 2-6 다중행 선택 : iloc
df.iloc[[0,3,5]]

# 2-7 다중열 선택 : loc
df.loc[:,['Y','Z']]

# 2-8 다중열 선택 : iloc
df.iloc[:,[2,4]]

    W   Y
A  97  90
B  43  13
C  56   4
D  91  28
E  71  23
F  77  88

In [47]:
# 2-9 행과 열 모두 선택 : loc
df.loc[['A','E'],['W','Y']]

# 2-10 행과 열 모두 선택 : iloc
df.iloc[[2,5],[2,5]]

# 2-11 조건을 이용한 행 선택
df[df['W']>70]

# 2-12 조건을 이용한 열 선택
df.loc[:, df.loc['A']>50]

    U   W   Y   Z
A  57  97  90  67
B  29  43  13  19
C  53  56   4  83
D  76  91  28  10
E  86  71  23  66
F  70  77  88  94

In [52]:
# 2-13 슬라이싱을 이용한 행 선택
df[1:4]

# 2-14 슬라이싱을 이용한 열 선택
df.loc[:, 'W':'Y']

# 2-15 bool 인덱싱을 사용한 행 선택
df[df.index.isin(['A', 'C', 'F'])]

# 2-16 bool 인덱싱을 사용한 열 선택
df.loc[:, df.columns.isin(['V', 'U'])]

    U   V   W   X   Y   Z
A  57  26  97  35  90  67
C  53  44  56  32   4  83
F  70   9  77  33  88  94